#+BEGIN_SRC ipython :session :exports both
  import pandas as pd
  import numpy as np
  import json
#+END_SRC

#+RESULTS:

Load mtgjson into the `cards` variable

#+BEGIN_SRC ipython :session :results output :exports both
  with open('./allcards.json') as infile:
      cards = json.load(infile)

  print(cards['Air Elemental'])
  print(cards['Ætherling'])
  print(cards['Far'])
#+END_SRC

#+RESULTS:
: {'layout': 'normal', 'subtypes': ['Elemental'], 'manaCost': '{3}{U}{U}', 'power': '4', 'colors': ['Blue'], 'toughness': '4', 'imageName': 'air elemental', 'colorIdentity': ['U'], 'cmc': 5, 'text': 'Flying', 'types': ['Creature'], 'name': 'Air Elemental', 'type': 'Creature — Elemental'}
: {'layout': 'normal', 'subtypes': ['Shapeshifter'], 'manaCost': '{4}{U}{U}', 'power': '4', 'colors': ['Blue'], 'toughness': '5', 'imageName': 'ætherling', 'colorIdentity': ['U'], 'cmc': 6, 'text': "{U}: Exile Ætherling. Return it to the battlefield under its owner's control at the beginning of the next end step.\n{U}: Ætherling can't be blocked this turn.\n{1}: Ætherling gets +1/-1 until end of turn.\n{1}: Ætherling gets -1/+1 until end of turn.", 'types': ['Creature'], 'name': 'Ætherling', 'type': 'Creature — Shapeshifter'}
: {'layout': 'split', 'types': ['Instant'], 'colorIdentity': ['B', 'U'], 'names': ['Far', 'Away'], 'manaCost': '{1}{U}', 'cmc': 2, 'text': "Return target creature to its owner's hand.\nFuse (You may cast one or both halves of this card from your hand.)", 'colors': ['Blue'], 'imageName': 'far', 'name': 'Far', 'type': 'Instant'}

Google sheets api:

#+BEGIN_SRC ipython :session :results output :exports both
  file_id = '1YHYoEoFFiPwH4LG4_34-EIghaphHR1OAT02pgcj595Q'
  sheet_id = '678309503' #individual sheets have ids too
  range_name = 'B8:I540'
  with open('secrets.txt', 'r') as infile:
      API_KEY = infile.read()

  SCOPES = 'https://www.googleapis.com/auth/spreadsheets.readonly'
  API_URL = 'https://sheets.googleapis.com/v4/spreadsheets/{}'
  import requests
  params = {'key': API_KEY, 'ranges': range_name, 'fields': 'properties.title,sheets(data.rowData.values(effectiveValue))'}
  req = requests.get(API_URL.format(file_id), params=params)
  print(req.status_code)
  data = req.json()
  
#+END_SRC

#+RESULTS:
: 200

#+BEGIN_SRC ipython :session :results output
  #print(data['sheets'][0]['data'][0]['rowData'][0])
  row_data = data['sheets'][0]['data'][0]['rowData']
  row_data = list(map(lambda x: x['values'], row_data))

  card_list = list(filter(None, [card.get('effectiveValue').get('stringValue') if card.get('effectiveValue') else None for row in row_data for card in row]))
  print(card_list[:5])
  print(len(card_list))
#+END_SRC


#+RESULTS:
: ['Ajani, Caller of the Pride', 'Aetherling', 'Bile Blight', 'Abbot of Keral Keep', 'Acidic Slime']
: 506

#+BEGIN_SRC ipython :session :results output :exports both
  import re
  q_filter = re.compile('[?]')
  card_list = list(map(lambda x: q_filter.sub('', x), card_list))
  print(card_list[:5])
#+END_SRC

#+RESULTS:
: ['Ajani, Caller of the Pride', 'Aetherling', 'Bile Blight', 'Abbot of Keral Keep', 'Acidic Slime']


#+BEGIN_SRC ipython :session :results output :exports both
  cube_list = []

  def parse_color(colors, card_type):
      if 'Land' in card_type:
          return 'Land'
      elif colors == None:
          return 'Colorless'
      elif len(colors) == 1:
          return colors[0]
      elif len(colors) > 1:
          return 'Multicolored'
      else:
          return 'ERROR'

  for card_name in card_list:
      card_name = card_name.strip()
      if 'Aether' in card_name: #what idiot thought it would be funny to use weird UTF8 encoding on this
          card_name = card_name.replace('Aether', 'Æther')
      split_card = False
      if '/' in card_name: #what idiot thought it would be funny to split up split cards
          split_card = True
      if split_card:
          card_info = [cards[card_name.split('/')[0]], cards[card_name.split('/')[1]]]
      else:
          card_info = [cards[card_name]]
      for card_in in card_info:
          cube_list.append({'name': card_in['name'], 'cmc': card_in.get('cmc'), 'color': parse_color(card_in.get('colors'), card_in['type']), 'text': card_in.get('text')})
  cube_list = pd.DataFrame(cube_list)
  print(cube_list.head())
#+END_SRC

#+RESULTS:
#+begin_example
   cmc  color                        name  \
0  3.0  White  Ajani, Caller of the Pride   
1  6.0   Blue                   Ætherling   
2  2.0  Black                 Bile Blight   
3  2.0    Red         Abbot of Keral Keep   
4  5.0  Green                Acidic Slime   

                                                text  
0  +1: Put a +1/+1 counter on up to one target cr...  
1  {U}: Exile Ætherling. Return it to the battlef...  
2  Target creature and all other creatures with t...  
3  Prowess (Whenever you cast a noncreature spell...  
4  Deathtouch (Any amount of damage this deals to...  
#+end_example

#+BEGIN_SRC ipython :session :results output :exports both
  print(cube_list['color'].unique())
  print(cube_list[cube_list['color'] == 'Colorless'].head())
  cube_list['cmc'] = cube_list['cmc'].fillna(0)
  print(cube_list['cmc'].unique())
  print(cube_list[cube_list['cmc'] == 0])
  import matplotlib.pyplot as plt
  import seaborn as sns

  for color in cube_list['color'].unique():
      if color != 'Land':
          plt.title('CMC for {}'.format(color))
          plt.hist(cube_list[cube_list['color'] == color]['cmc'])
          plt.xlim([0, 10])
          plt.savefig('./graphs/{}_cmc.png'.format(color))
     
          plt.clf()
#+END_SRC

#+RESULTS:
#+begin_example
['White' 'Blue' 'Black' 'Red' 'Green' 'Multicolored' 'Land' 'Colorless']
    cmc      color              name  \
7   1.0  Colorless  Adventuring Gear   
15  2.0  Colorless  Arcbound Ravager   
23  1.0  Colorless   Basilisk Collar   
31  5.0  Colorless       Batterskull   
39  3.0  Colorless  Cloudstone Curio   

                                                 text  
7   Landfall — Whenever a land enters the battlefi...  
15  Sacrifice an artifact: Put a +1/+1 counter on ...  
23  Equipped creature has deathtouch and lifelink....  
31  Living weapon (When this Equipment enters the ...  
39  Whenever a nonartifact permanent enters the ba...  
[  3.   6.   2.   5.   0.   1.   7.   4.   9.   8.  10.]
     cmc      color                          name  \
6    0.0       Land                 Bant Panorama   
9    0.0       Blue              Ancestral Vision   
14   0.0       Land                Esper Panorama   
22   0.0       Land               Grixis Panorama   
30   0.0       Land                 Jund Panorama   
38   0.0       Land                 Naya Panorama   
46   0.0       Land                   Flood Plain   
54   0.0       Land                     Bad River   
62   0.0       Land                 Rocky Tar Pit   
63   0.0  Colorless           Everflowing Chalice   
70   0.0       Land               Mountain Valley   
71   0.0  Colorless             Hangarback Walker   
78   0.0       Land                    Grasslands   
79   0.0  Colorless                   Lotus Bloom   
86   0.0       Land           Celestial Colonnade   
87   0.0  Colorless                       Memnite   
94   0.0       Land              Creeping Tar Pit   
102  0.0       Land              Lavaclaw Reaches   
110  0.0       Land                 Raging Ravine   
111  0.0  Colorless                      Mox Opal   
118  0.0       Land             Stirring Wildwood   
119  0.0  Colorless                   Ornithopter   
126  0.0       Land                Shambling Vent   
134  0.0       Land            Wandering Fumarole   
142  0.0       Land              Hissing Quagmire   
150  0.0       Land                 Needle Spires   
158  0.0       Land               Lumbering Falls   
166  0.0       Land             Temple of Silence   
174  0.0       Land            Temple of Epiphany   
182  0.0       Land              Temple of Malady   
190  0.0       Land             Temple of Triumph   
198  0.0       Land             Temple of Mystery   
206  0.0       Land             Hallowed Fountain   
214  0.0       Land                  Watery Grave   
222  0.0       Land                   Blood Crypt   
231  0.0       Land               Stomping Ground   
239  0.0       Land                 Temple Garden   
247  0.0       Land                Godless Shrine   
255  0.0       Land                   Steam Vents   
262  0.0       Land                Overgrown Tomb   
270  0.0       Land                Sacred Foundry   
278  0.0       Land                 Breeding Pool   
285  0.0       Land                Evolving Wilds   
292  0.0       Land          Terramorphic Expanse   
299  0.0       Land               Blinkmoth Nexus   
306  0.0       Land                 Inkmoth Nexus   
313  0.0       Land                     Mutavault   
326  0.0       Land                        Vesuva   
333  0.0       Land               Kessig Wolf Run   
340  0.0       Land            Nephalia Drownyard   
347  0.0       Land        Nykthos, Shrine to Nyx   
354  0.0       Land               Cavern of Souls   
361  0.0       Land  Valakut, the Molten Pinnacle   
374  0.0       Land                   Ancient Den   
381  0.0       Land             Darksteel Citadel   
388  0.0       Land                 Great Furnace   
395  0.0       Land             Seat of the Synod   
402  0.0       Land                 Tree of Tales   
409  0.0       Land             Vault of Whispers   

                                                  text  
6    {T}: Add {C} to your mana pool.\n{1}, {T}, Sac...  
9    Suspend 4—{U} (Rather than cast this card from...  
14   {T}: Add {C} to your mana pool.\n{1}, {T}, Sac...  
22   {T}: Add {C} to your mana pool.\n{1}, {T}, Sac...  
30   {T}: Add {C} to your mana pool.\n{1}, {T}, Sac...  
38   {T}: Add {C} to your mana pool.\n{1}, {T}, Sac...  
46   Flood Plain enters the battlefield tapped.\n{T...  
54   Bad River enters the battlefield tapped.\n{T},...  
62   Rocky Tar Pit enters the battlefield tapped.\n...  
63   Multikicker {2} (You may pay an additional {2}...  
70   Mountain Valley enters the battlefield tapped....  
71   Hangarback Walker enters the battlefield with ...  
78   Grasslands enters the battlefield tapped.\n{T}...  
79   Suspend 3—{0} (Rather than cast this card from...  
86   Celestial Colonnade enters the battlefield tap...  
87                                                None  
94   Creeping Tar Pit enters the battlefield tapped...  
102  Lavaclaw Reaches enters the battlefield tapped...  
110  Raging Ravine enters the battlefield tapped.\n...  
111  Metalcraft — {T}: Add one mana of any color to...  
118  Stirring Wildwood enters the battlefield tappe...  
119  Flying (This creature can't be blocked except ...  
126  Shambling Vent enters the battlefield tapped.\...  
134  Wandering Fumarole enters the battlefield tapp...  
142  Hissing Quagmire enters the battlefield tapped...  
150  Needle Spires enters the battlefield tapped.\n...  
158  Lumbering Falls enters the battlefield tapped....  
166  Temple of Silence enters the battlefield tappe...  
174  Temple of Epiphany enters the battlefield tapp...  
182  Temple of Malady enters the battlefield tapped...  
190  Temple of Triumph enters the battlefield tappe...  
198  Temple of Mystery enters the battlefield tappe...  
206  ({T}: Add {W} or {U} to your mana pool.)\nAs H...  
214  ({T}: Add {U} or {B} to your mana pool.)\nAs W...  
222  ({T}: Add {B} or {R} to your mana pool.)\nAs B...  
231  ({T}: Add {R} or {G} to your mana pool.)\nAs S...  
239  ({T}: Add {G} or {W} to your mana pool.)\nAs T...  
247  ({T}: Add {W} or {B} to your mana pool.)\nAs G...  
255  ({T}: Add {U} or {R} to your mana pool.)\nAs S...  
262  ({T}: Add {B} or {G} to your mana pool.)\nAs O...  
270  ({T}: Add {R} or {W} to your mana pool.)\nAs S...  
278  ({T}: Add {G} or {U} to your mana pool.)\nAs B...  
285  {T}, Sacrifice Evolving Wilds: Search your lib...  
292  {T}, Sacrifice Terramorphic Expanse: Search yo...  
299  {T}: Add {C} to your mana pool.\n{1}: Blinkmot...  
306  {T}: Add {C} to your mana pool.\n{1}: Inkmoth ...  
313  {T}: Add {C} to your mana pool.\n{1}: Mutavaul...  
326  You may have Vesuva enter the battlefield tapp...  
333  {T}: Add {C} to your mana pool.\n{X}{R}{G}, {T...  
340  {T}: Add {C} to your mana pool.\n{1}{U}{B}, {T...  
347  {T}: Add {C} to your mana pool.\n{2}, {T}: Cho...  
354  As Cavern of Souls enters the battlefield, cho...  
361  Valakut, the Molten Pinnacle enters the battle...  
374  (Ancient Den isn't a spell.)\n{T}: Add {W} to ...  
381  Indestructible (Effects that say "destroy" don...  
388                    {T}: Add {R} to your mana pool.  
395  (Seat of the Synod isn't a spell.)\n{T}: Add {...  
402  (Tree of Tales isn't a spell.)\n{T}: Add {G} t...  
409  (Vault of Whispers isn't a spell.)\n{T}: Add {...  
#+end_example

